Tekla.Structures.Dialog.Data.DefaultAppliedAttributesSelector
The Tekla.Structures.Dialog.Data.DefaultAppliedAttributesSelector class selects the current applied attributes for any Tekla.Structures.Model.Part instance.

Tekla.Structures.Dialog.Data.DefaultAppliedAttributesSelector.SelectAppliedAttributes(Tekla.Structures.Model.Part,Tekla.Structures.Dialog.Data.MaterialType)
Selects the current applied attributes to the given Tekla.Structures.Model.Part instance.
Throws System.ArgumentNullException: Thrown when part is null.
Throws System.ApplicationException: Thrown when the applied attributes cannot be selected for part.
part: The Tekla.Structures.Model.Part to set the current applied values to.
materialType: The type of material of part.

Tekla.Structures.Dialog.Data.DefaultAppliedAttributesSelector.SelectDefaultEndPoints(Tekla.Structures.Model.Beam,Tekla.Structures.Dialog.Data.MaterialType,Tekla.Common.Geometry.Vector3)
Selects the default end points to column for the given referencePosition.
The Tekla.Structures.Model.Beam.Type property of column must be set to either Tekla.Structures.Model.Beam.BeamTypeEnum.COLUMN or Tekla.Structures.Model.Beam.BeamTypeEnum.PAD_FOOTING.
Throws System.ArgumentException:
Thrown when column is neither of type Tekla.Structures.Model.Beam.BeamTypeEnum.COLUMN or Tekla.Structures.Model.Beam.BeamTypeEnum.PAD_FOOTING.
Throws System.ArgumentNullException:
Thrown when column is null.
Throws System.ApplicationException:
Thrown when the applied attributes cannot be selected for column.
column: The Tekla.Structures.Model.Beam to set the default Tekla.Structures.Model.Beam.StartPoint and Tekla.Structures.Model.Beam.EndPoint values on.
materialType: The type of material of column.
referencePosition: The reference location to position column against.